#!/bin/bash

# set -x

#-BASH-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#-END BASH-------------------------------------------------------------------------------------------------------------------------------------------------------------------------

#-VARS-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
. '/data/shells/bash/lib/start.var'
. "${LIB_DIR}/date.var"
#-END Vars-------------------------------------------------------------------------------------------------------------------------------------------------------------------------

#-FUNCTIONS------------------------------------------------------------------------------------------------------------------------------------------------------------------------
. "${LIB_DIR}/start.fn"
. "${LIB_DIR}/date.fn"
#----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
_HELP () {
  echo
  echo "Запуск: ${SHELLS_DIR}/doing.sh <key> [data]

                <key>:
                      -add            - добавление записи
                      -date <date>    - просмотр записей по дате
                      -words <string> - просмотр записей по строке
                      -all            - просмотр всех записей
                      -del <number>   - удаление строки по номеру
                      -?              - подсказка"
  echo
  _EXIT 3
}
#----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
_ADD_DOING () {
  _READ_DATE
  _READ_TIME 
  echo -n "Укажите задание: "
  read STRING
  echo -n "Будет добавлена запись \"${DATE} ${TIME} ${STRING}\". Вы уверены? "
  read -n1 OTVET
  echo
  case ${OTVET} in
    y|Y|н|Н)
      echo "|${DATE}|${TIME}|${STRING}|" >> ${RES}
      [ "$?" -eq '0' ] && echo "Запись успешно добавлена."
      ;;
    *)
      ;;
  esac
}
#----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
_VARS () {
  DAY=`echo "${LISTING}" | awk "NR==${x}" | awk -F'|' '{print $2}' | cut -c 1-2`
  MOUNT=`echo "${LISTING}" | awk "NR==${x}" | awk -F'|' '{print $2}' | cut -c 4-5`
  YEAR=`echo "${LISTING}" | awk "NR==${x}" | awk -F'|' '{print $2}' | cut -c 7-10`
  TIME=`echo "${LISTING}" | awk "NR==${x}" | awk -F'|' '{print $3}'`
  STRING=`echo "${LISTING}" | awk "NR==${x}" | awk -F'|' '{print $4}'`
  case ${MOUNT} in
    01)
      MOUNT='  января'
      ;;
    02)
      MOUNT=' февраля'
      ;;
    03)
      MOUNT='   марта'
      ;;
    04)
      MOUNT='  апреля'
      ;;
    05)
      MOUNT='     мая'
      ;;
    06)
      MOUNT='    июня'
      ;;
    07)
      MOUNT='    июля'
      ;;
    08)
      MOUNT=' августа'
      ;;
    09)
      MOUNT='сентября'
      ;;
    10)
      MOUNT=' октября'
      ;;
    11)
      MOUNT='  ноября'
      ;;
    12)
      MOUNT=' декабря'
      ;;
  esac
}
#----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
_LS_DATE_DOING () {
  LISTING=`cat "${RES}" | grep "${1}"`
  [ ! -z "${LISTING}" ] && COUNT=$((`echo "${LISTING}" | wc -l`))
  [ -z "${LISTING}" ] && LISTING="|$1"
  x=1
  _VARS
  echo
  echo "Количество запланированных на ${DAY}-е ${MOUNT} ${YEAR}-го года задач: ${COUNT}"
  echo
  for ((x=1;x<=${COUNT};x++))
    do
      _VARS
      echo "В ${TIME}: ${STRING}"
    done
  echo
}
#----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
_LS_WORDS_DOING () {
  STRING="$*"
  [ -z "${STRING}" ] && _EXIT 4
  LISTING=`cat "${RES}" | grep "${STRING}"`
  [ ! -z "${LISTING}" ] && COUNT=$((`echo "${LISTING}" | wc -l`))
  echo
  echo "Количество записей по запросу \"${STRING}\": ${COUNT}"
  echo
  for ((x=1;x<=${COUNT};x++))
    do
      _VARS
      echo "${DAY}-го ${MOUNT} ${YEAR}-го года в ${TIME}: ${STRING}"
    done
  echo
}
#----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
_LS_DOING () {
  LISTING=`cat "${RES}"`
  COUNT=$((`echo "${LISTING}" | wc -l`))
  echo
  echo "Количество записей: ${COUNT}"
  echo
  for ((x=1;x<=${COUNT};x++))
    do
      _VARS
      echo "${DAY}-го ${MOUNT} ${YEAR}-го года в ${TIME}: ${STRING}"
    done
  echo
}
#----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
_DEL_DOING () {
  STRING=`cat ${RES} | awk "NR==$1"`
  cat ${RES} | grep -v "${STRING}" > ${TMP}
  cp ${RES} ${RES}.old
  cp ${TMP} ${RES}
  [ "$?" -eq '0' ] && echo 'Запись удалена.' 
  [ -z "`cat ${RES}`" ] && rm ${RES}
}
#----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
_CONTROL_DOING () {
  _NEXT_DATA `date +%d.%m.%Y`
  LISTING=`cat ${RES} | grep "${DATE}"`
  [ -z "${LISTING}" ] && _EXIT 5
  COUNT=$((`echo "${LISTING}" | wc -l`))
  for ((x=1;x<=${COUNT};x++))
    do
      _VARS
      TEXT="${DAY}-го ${MOUNT} ${YEAR}-го года в ${TIME}: ${STRING}"
      notify-send "${TEXT}"      
    done
}
#-END FUNCTIONS--------------------------------------------------------------------------------------------------------------------------------------------------------------------

#-PROGRAM--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
if [ ! -f "${RES}" -a "$1" != '-add' ]
  then
    echo
    echo "Файл с делами отсутствует."
    _EXIT 1
fi
case $1 in
  '-add')
    _ADD_DOING
    ;;
  '-date')
    shift
    _LS_DATE_DOING ${1}
    ;;
  '-words')
    shift
    _LS_WORDS_DOING ${*}
    ;;
  '-all')
    _LS_DOING
    ;;
  '-del')
    shift
    _DEL_DOING $1
    ;;
  '-control')
    _CONTROL_DOING
    ;;
  '-?')
    _HELP
    ;;
  *)
    echo "Неверный запуск."
    _EXIT 2
    ;;
esac
_EXIT 0
#-END PROGRAM----------------------------------------------------------------------------------------------------------------------------------------------------------------------
