Repository: felixonmars/aur3-mirror
Catalog: nautilus-image-manipulator/*.po
Languages: pt_br

source: Please enter a value for the subdirectory.
pt_br: Por favor, insira um valor para o subdiretório.

source: Please enter some text to append to the filename.
pt_br: Por favor, insira algum texto para adicionar ao final do nome de arquivo.

source: The string to append cannot end in %s
pt_br: A frase a ser adicionada não pode terminar em %s

source: Resizing images...
pt_br: Redimensionando imagens...

source: Your images have not been sent, but have been zipped together into this file: %(filename)s
pt_br: Suas imagens não foram enviadas, contudo, elas foram compactadas neste arquivo: %(filename)s

source: Your image has not been sent, but has successfully been resized. You can find it at %(filename)s
pt_br: Sua imagem não foi enviada, contudo, foi redimensionada com sucesso. Você pode encontrá-la em %(filename)s

source: The selected upload site %(site_name)s is not valid.
pt_br: O website selecionado para envio %(site_name)s não é válido.

source: Please file a bug report on Launchpad
pt_br: Por favor, abra uma notificação de bug no Launchpad

source: The upload site %(site_name)s could not be contacted, please check your internet connection.
pt_br: O website de envio %(site_name)s não pôde ser contactado, por favor, verifique a sua conexão de internet.

source: Uploading images...
pt_br: Fazendo upload das imagens...

source: Invalid parameters
pt_br: Parâmetros inválidos

source: _Skip
pt_br: _Ignorar

source: _Retry
pt_br: _Repetir

source: The image "%(image)s" could not be resized. Check whether you have permission to write to this folder: %(folder)s
pt_br: A imagem "%(image)s" não pôde ser redimensionada. Verifique se você possui permissão de escrita nesta pasta: %(folder)s

source: The image conversion program wasn't found on your system. Have you installed ImageMagick?
pt_br: O programa de conversão de imagem não foi encontrado no seu sistema. Você já instalou o ImageMagick?

source: Could not resize image
pt_br: Não foi possível redimensionar a imagem

source: resized
pt_br: redimensionado

source: -resized
pt_br: -redimensionado

source: show debug messages
pt_br: exibir mensagens de debug

source: a file to be resized. Use multiple arguments to resize multiple files.
pt_br: um arquivo para ser redimensionado. Use argumentos múltiplos para redimensionar múltiplos arquivos.

source: _Resize image
pt_br: _Redimensionar imagem

source: Nautilus Image Manipulator needs to be provided with a list of images to resize. Please right-click on an image and select the "%(resizeImages)s" option.
pt_br: O "Manipulador de Imagens do Nautilus" necessita que uma lista de imagens (a serem redimensionadas) seja fornecida. Por favor, clique com o botão direito do mouse em uma imagem e selecione a opção "%(resizeImages)s".

source: No images provided
pt_br: Nenhuma imagem foi fornecida

source: Packing images...
pt_br: Criando pacote com imagens...

source: An error occurred!
pt_br: Ocorreu um erro!

source: Append
pt_br: Anexar

source: Attach to an email message
pt_br: Anexar a um e-mail

source: Custom size:
pt_br: Tamanho personalizado:

source: Delete url:
pt_br: Apagar url:

source: Download url:
pt_br: Endereço de download:

source: Height:
pt_br: Altura:

source: Image Size
pt_br: Tamanho da Imagem

source: Images successfully uploaded!
pt_br: As imagens foram enviadas com sucesso!

source: Output Options
pt_br: Opções de Saída

source: Put in subdirectory called
pt_br: Colocar no sub-diretório

source: Resize images
pt_br: Redimensionar imagens

source: Resize in place
pt_br: Redimensionar e substituir no mesmo arquivo

source: Scale:
pt_br: Escala:

source: Select a size:
pt_br: Selecione um tamanho:

source: Send the resized images
pt_br: Enviar as imagens redimensionadas

source: Sending Options
pt_br: Opções de Envio

source: The download url has been copied in the clipboard
pt_br: O endereço de download foi copiado para área de transferência

source: This value will be appended before the image extension
pt_br: Este valor será anexado antes da extensão da imagem

source: Upload a .zip file to
pt_br: Enviar um arquivo .zip para

source: Width:
pt_br: Largura:

source: percent
pt_br: porcento

source: to file name
pt_br: para o nome do arquivo

source: Resize the selected image
pt_br: Redimensionar a imagem selecionada
